# ContinuousrailBeginningTerminationAttachmentParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ContinuousrailBeginningTerminationAttachmentParam Property
ParameterTypeId Class See Also
---
"Extension Style"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ContinuousrailBeginningTerminationAttachmentParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContinuousrailBeginningTerminationAttachmentParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ContinuousrailBeginningTerminationAttachmentParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace